app/Http/Controllers/QuestionController.php

                function (string $attribute, mixed $value, Closure $fail) {
                    if($value[strlen($value) - 1] != '?') {
                        $fail('Are you sure that is a question ? It is missing the question mark in the end.');
                    }
                }, ],
        ]);

        Question::query()->create($attributes);
---
insert into `questions` (`question`, `updated_at`, `created_at`) values ('Qual é o seu nome ?', '2024-02-24 22:58:29', '2024-02-24 22:58:29')